// チェッカー
function setup() {
  createCanvas(200, 200);
  let size = width / 8;
  noStroke();
  for(let i = 0; i < 8; i++){ //格子を描く
    for(let j = 0; j < 8; j++){
      if(i % 2 == 1 && j % 2 == 0){//xが奇数かつyが偶数の時
        fill(160);//グレーに塗りつぶす
        rect(i * 10, j * 10, 10, 10);//四角
      }
      if(i % 2 == 0 && j % 2 == 1){//xが偶数かつyが奇数の時
        fill(160);
        rect(i * 10, j * 10, 10, 10);
      }
}
}
for(let i = 0; i < 8; i++){ //上三段の丸を描く
  for(let j = 0; j < 3; j++){
    fill(255, 0, 0);
    if(i % 2 == 1 && j % 2 == 0){//xが奇数かつyが偶数の時
      ellipse(i * 10 + 5, j * 10 + 5, 8);//円
    }
　   if(i % 2 == 0 && j % 2 == 1){//xが偶数かつyが奇数の時
      ellipse(i * 10 + 5, j * 10 + 5, 8);//円
    }
}
}

for(let i = 0; i < 8; i++){ //下三段の丸を描く
  for(let j = 5 ; j < 8; j++){//こんなキモすぎる切り方でいいのか？？
    fill(0, 0, 0);
    if(i % 2 == 1 && j % 2 == 0){//xが奇数かつyが偶数の時
      ellipse(i * 10 + 5, j * 10 + 5, 8);//円
    }
　   if(i % 2 == 0 && j % 2 == 1){//xが偶数かつyが奇数の時
      ellipse(i * 10 + 5, j * 10 + 5, 8);//円
    }
}
}


}

//色の塗り分けがわかんない！！→とりあえず、できる範囲でやってみたけど他に方法ありそう（10/12）
// BLANK[1] (hint: rectのx座標は size * i, y座標はsize * j)
